# =============================================================================
# Fonts
# =============================================================================
cask "font-hack-nerd-font"
cask "font-fira-code"

# =============================================================================
# macOS GUI Apps
# =============================================================================
cask "iterm2"
cask "appcleaner"
cask "betterdisplay"
cask "ghostty"
cask "lookaway"
cask "openmtp"
cask "rsyncui"
cask "stretchly"
cask "utm"

# =============================================================================
# Mac App Store
# =============================================================================
brew "mas"

# =============================================================================
# Shell & Terminal
# =============================================================================
brew "bash"
brew "bash-completion@2"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "thefuck"
brew "atuin"
brew "direnv"
brew "tmux"
brew "starship"

# =============================================================================
# Core Utilities (GNU replacements)
# =============================================================================
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "grep"
brew "openssh"
brew "wget"

# =============================================================================
# Search & Navigation
# =============================================================================
brew "ripgrep"
brew "fzf"
brew "eza"
brew "bat"
brew "fd"
brew "autojump"
brew "tree"
brew "dust"
brew "duf"
brew "tealdeer"
brew "glow"
brew "sd"
brew "procs"
brew "choose-rust"
brew "doggo"
brew "gping"

# =============================================================================
# Git
# =============================================================================
brew "git"
brew "git-delta"
brew "git-crypt"
brew "git-lfs"
brew "git-extras"
brew "lazygit"
brew "gh"

# =============================================================================
# Programming Languages & Managers
# =============================================================================
brew "jenv"
brew "nvm"
brew "go"
brew "sbt"
brew "maven"
brew "scala"
brew "ammonite-repl"
brew "zig"

# =============================================================================
# Cloud & Infrastructure
# =============================================================================
brew "awscli"
brew "tfenv"
brew "helm"
brew "kustomize"

# =============================================================================
# JSON/YAML Processing
# =============================================================================
brew "jq"
brew "yq"

# =============================================================================
# Monitoring
# =============================================================================
brew "htop"
brew "watch"
brew "cloc"
brew "act"

# =============================================================================
# Network & Security
# =============================================================================
brew "gnupg"
brew "nmap"
brew "socat"
brew "mkcert"
brew "ssh-copy-id"

# =============================================================================
# File & Text Utilities
# =============================================================================
brew "p7zip"
brew "xz"
brew "imagemagick"

# =============================================================================
# Media & Audio
# =============================================================================
brew "ffmpeg"
brew "flac"

# =============================================================================
# Databases (dev)
# =============================================================================
brew "postgresql@14"
brew "mysql-client"
brew "librdkafka"
