# brew GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$( --prefix coreutils)/libexec/gnubin` to `$PATH`.
tap "bramstein/webfonttools"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "ethereum/ethereum"
tap "loadimpact/k6"



brew "solidity"
#linkapps "solidity"

#FONTS!!!
cask "font-hack-nerd-font"

#MAC APP STORE CLI
brew "mas"

brew "direnv"
brew "ripgrep"
brew "fzf"
brew "the_silver_searcher" # the mighty ag
brew "coreutils"
#DOT FILE MANAGER
brew "stow"
# brew some other useful utilities like `sponge`.
brew "moreutils"
# brew GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
# GNU tar
brew "gnu-tar"
# brew GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed" ,args: ["--with-default-names"]
brew "autojump"
# Magnificent app which corrects your previous console command
brew "thefuck"
# Symlink manager
brew "stow"

# brew Bash 4.
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before
# running `chsh`.
brew "bash"
brew "bash-completion2"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "getantibody/tap/antibody"

# brew `wget` with IRI support.
brew "wget" ,args: ["--with-iri"]
# brew GnuPG to enable PGP-signing commits.
brew "gnupg"
brew "gettext"

# brew font tools.
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "bramstein/webfonttools/woff2"

# brew more recent versions of some macOS tools.
brew "vim" ,args:["--with-override-system-vi"]
cask "sublime-text"
brew "grep"
brew "openssh"
brew "screen"

# perf tools
brew "k6"

# Programming
brew "bazel"
brew "solidity"
brew "sbt"
brew "maven"
brew "scala"
brew "ruby"
brew "rbenv"
brew "python3"
brew "pyenv"
brew "jenv"
brew "apache-spark"
brew "cmake"
brew "go"
brew "glide"
brew "lua"
brew "rust"
brew "elixir"
brew "node"
brew "nvm"
brew "git"
brew "git-crypt"
brew "git-lfs"

brew "tfenv" #Terraform
brew "packer"
brew "awscli"

brew "jq"
brew "jshon"
brew "awk"
brew "midnight-commander"
brew "tor"
brew "torsocks"
brew "watch"
brew "tmux"

# brew some CTF tools; see https://github.com/ctfs/write-ups.
brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hashpump"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "ucspi-tcp" # `tcpserver` etc.
brew "xz"
brew "acrogenesis/macchanger/macchanger"

# brew other useful binaries.
brew "ack"
# brew exiv2
brew "imagemagick" ,args: ["--with-webp"]
brew "htop"

brew "lynx"
brew "surfraw"
brew "w3m"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"

brew "peco"
brew "md5sha1sum"


#MUSIC
brew "shpotify"
## convertors
brew "flac"
brew "sox"
